* NOTES
- pairings
- pairing groups
- order of the pairing groups
- pairings in Solidity (precompile)

#+BEGIN_SRC sage  :session . :exports both
import py_ecc.bn128 as bn128

p=21888242871839275222246405745257275088696311157297823662689037894645226208583
Fp=GF(p)
E = EllipticCurve(Fp, [0,3])
G1 = E(1,2)

n=G1.order()
# embedding degree
k=2
t=E.trace_of_frobenius()

Fp2 = GF((p,k), name='i', modulus=x^k + 1)

a=0
TwistB=3*Fp2([9,1])^(-1) # 3/(i+9)

E2 = EllipticCurve(Fp2, [a,TwistB])
#E2 = E.base_extend(Fp2)

# [a,b] -> a + i*b
x_G2 = Fp2([
  10857046999023057135944570762232829481370756359578518086990519993285655852781,
  11559732032986387107991004021392285783925812861821192530917403151452391805634
])

y_G2 = Fp2([
  8495653923123431417604973247489272438418190587263600148770280649306958101930,
  4082367875863433681332203403145435568316851327593401208105741076214120093531
])

G2 = E2(x_G2, y_G2)

# G2 is of the same order as G1
assert(n*G2 == E2(0))

# Show the generators
#G1, G2

P = 3 * G1
Q = 4 * G2
R = 12 * G2


G1_sage = (bn128.FQ(int(G1[0])), bn128.FQ(int(G1[1])))
#bn128.multiply((G1[0], G1[1]),3)
bn128.multiply(G1_sage,3)

# https://github.com/ethereum/py_ecc/blob/main/py_ecc/bn128/bn128_curve.py#L38

G2_sage = ( bn128.FQ2([int(G2[0][0]), int(G2[0][1])]),
            bn128.FQ2([int(G2[1][0]), int(G2[1][1])]) )

bn128.multiply(G2_sage, 8)


def pairing(P,Q):
 return bn128.pairing( (bn128.FQ2([int(Q[0][0]), int(Q[0][1])]),
                        bn128.FQ2([int(Q[1][0]), int(Q[1][1])])),
                       (bn128.FQ(int(P[0])), bn128.FQ(int(P[1]))) )

pairing(P,Q)

#+END_SRC

#+RESULTS:
: (3353031288059533942658390886683067124040920775575537747144343083137631628272,
:  19321533766552368860946552437480515441416830039777911637913418824951667761761)
: ((11166086885672626473267565287145132336823242144708474818695443831501089511977, 1513450333913810775282357068930057790874607011341873340507105465411024430745),
:  (10576778712883087908382530888778326306865681986179249638025895353796469496812, 20245151454212206884108313452940569906396451322269011731680309881579291004202))
: (15601246016983417620445188006067559251543215122312274362793180396629824398765, 14246743357492531742594226782128091210799645513600093008255002923531139757440, 21246528159150726701143497950911499564087497326119441605766127519735982097597, 17436280400242596046989587441318535416421721826763639552802078328724151425537, 15547233307497967574973212290527572432984848843781882171872148786972202368032, 15534527476327095590151085940887779234629190035885071294285830491019101396006, 1692483343583165135477825229458526416173742960528124726619847063046617622926, 18039014995310741533499435523514455418946747293809436454452684060284916858764, 3819483528054749127381421555378541638311106506417320721752289504154090892774, 9304846640412133065726617303096065916894576963948229503634133560057296443591, 8829429314060865060998132502145485865657576535642250650930798346925519759245, 12693463773924529243612131873073220323255622346320253723122182727824967203133)
